sim/simple_cylinder/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 3.06e-05;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 3.06e-05;
    }
    topBot
    {
        type            calculated;
        value           uniform 3.06e-05;
    }
    outlet
    {
        type            calculated;
        value           uniform 3.06e-05;
    }
    wall
    {
//        type            nutLowReWallFunction;
	   type		        nutUSpaldingWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
