sim/simple_cylinder/system/fieldAvg
fieldAverage
{
    type		fieldAverage;
    libs		(fieldFunctionObjects);
    writeControl    writeTime;

    fields
    (
        U
        {
            mean        on;
            prime2Mean  on;
            base        time;
        }

        p
        {
            mean        on;
            prime2Mean  on;
            base        time;
        }
    );
}
